app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6]]
SELECT COUNT(*) FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 3]]
---
  def index
    @bookings = current_user.bookings.includes(:room).paginate(page: params[:page], per_page: 10)

INSERT INTO "bookings" ("room_type", "user_id", "room_id", "start_date", "last_date", "created_at", "updated_at", "num_of_user") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @booking = current_user.bookings.build(booking_params)
    respond_to do |format|
      if @booking.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? AND "bookings"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
---
    def set_booking
      @booking = current_user.bookings.find_by_id(params[:id])